Revit 2027 API
WorksetConfiguration(WorksetConfiguration) Constructor
 Constructs a new copy of the input WorksetConfiguration object.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public WorksetConfiguration(
	WorksetConfiguration other
)
Public Sub New (
	other As WorksetConfiguration
)
public:
WorksetConfiguration(
	WorksetConfiguration^ other
)
new :
        other : WorksetConfiguration -> WorksetConfiguration
Parameters
other WorksetConfiguration
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
WorksetConfiguration Class
WorksetConfiguration Overload
Autodesk.Revit.DB Namespace